[
  {
    "id": 1,
    "info": "Sohith Kampalli",
    "description": "Full-Stack & Cloud Engineer specializing in scalable web and cloud applications with expertise in AWS, GCP, and Kubernetes (KCNA Certified). Skilled in building and deploying high-performance APIs, containerized microservices (Docker, Kubernetes), and cloud-native architectures. Experienced in backend optimization, CI/CD automation, and full-stack development using Next.js, Node.js, and Prisma. Based in the United States."
  },
  {
    "id": 2,
    "info": "Contact Information",
    "description": "United States | +1 (940) 977-1505 | sohithkampalli9@gmail.com | linkedin.com/in/sohithkampalli | https://github.com/sohithk2002"
  },
  {
    "id": 3,
    "info": "Education",
    "description": "Master of Science in Computer and Information Sciences, University of North Texas, Texas, United States (Aug 2023 – May 2025) | CGPA 3.88"
  },
  {
    "id": 4,
    "info": "Work Experience",
    "description": [
      {
        "role": "Software Engineer (Part-Time)",
        "company": "University of North Texas",
        "duration": "Aug 2024 – Present",
        "details": [
          "Optimized Eagle Connect, integrating AWS, GCP, and Azure AD, reducing latency by 30% and improving multi-cloud scalability.",
          "Developed & optimized REST APIs with Spring Boot & Node.js, implementing Redis caching and load balancing, reducing API response time by 25%.",
          "Enhanced database performance by optimizing PostgreSQL & DynamoDB queries, cutting retrieval time by 20%.",
          "Implemented MFA & IAM policies, reducing security incidents by 30% and strengthening role-based access control (RBAC).",
          "Automated CI/CD pipelines with Jenkins, Docker, and Kubernetes, achieving zero-downtime deployments and improving developer efficiency by 40%."
        ]
      },
      {
        "role": "Graduate Teaching Assistant",
        "company": "University of North Texas",
        "duration": "Jan 2024 – Jul 2024",
        "details": [
          "Led cryptographic security & payment gateway workshops for 100+ students, guiding them in secure API integration (Stripe, PayPal) and OAuth authentication.",
          "Evaluated assignments using industry security frameworks (ISO 27001, NIST, OWASP), ensuring real-world compliance.",
          "Mentored students in implementing secure APIs & payment gateways, strengthening their cybersecurity engineering skills.",
          "Integrated real-world cybersecurity case studies, bridging academic knowledge with modern security protocols."
        ]
      },
      {
        "role": "Software Engineer Intern",
        "company": "Persistent Systems",
        "duration": "Aug 2022 – June 2023",
        "details": [
          "Optimized Java applications using multithreading & caching, improving execution speed by 30% and scalability under high workloads.",
          "Designed & built RESTful APIs with Spring Boot & Hibernate, enhancing database interaction and data retrieval efficiency.",
          "Implemented CI/CD pipelines with Jenkins, Docker, and Kubernetes, enabling automated deployment and reducing rollback time by 50%.",
          "Conducted unit testing with JUnit & Mockito, achieving 95%+ test coverage and reducing production bugs by 35%.",
          "Improved server response time by 25% using Redis caching & horizontal scaling techniques."
        ]
      }
    ]
  },
  {
    "id": 5,
    "info": "Projects",
    "description": [
      {
        "name": "AI Career Coach – Full-Stack AI-Powered Job Assistant",
        "details": [
          "Developed an AI-driven career assistant, integrating Gemini AI & OpenAI for resume generation, cover letter writing, and job market insights.",
          "Built scalable APIs using Next.js Server Actions, optimizing AI response time by 40% with rate-limiting & caching.",
          "Implemented real-time AI chat using WebSockets, providing instant career feedback.",
          "Secured user authentication with Clerk (OAuth, JWT, RBAC), ensuring data privacy & role-based access control.",
          "Automated job market insights with Inngest background jobs, reducing manual research efforts by 60%."
        ]
      },
      {
        "name": "AI Finance Platform (Wealth) – AI-Powered Financial Management",
        "details": [
          "Developed an AI-powered receipt scanner, using Gemini AI to extract transaction details, reducing manual entry time by 60%.",
          "Designed & optimized financial transactions database with PostgreSQL (Supabase) & Prisma ORM, improving query efficiency by 40%.",
          "Automated budget tracking with Inngest (background job scheduling) and real-time email alerts (Resend API).",
          "Implemented API rate-limiting with Arcjet, ensuring secure financial transactions & stability under high loads.",
          "Built a financial analytics dashboard with interactive charts & spending trends using Power BI & Recharts."
        ]
      },
      {
        "name": "Data Visualization Dashboard – API-Driven Job & Finance Analytics",
        "details": [
          "Developing an API-driven dashboard for job market trends & financial analytics, integrating real-time insights.",
          "Designing predictive job demand models using AWS Lambda & PostgreSQL, automating data updates.",
          "Optimizing SQL queries & indexing, improving query execution time by 40%.",
          "Building REST APIs to feed real-time insights into Power BI & Tableau dashboards."
        ]
      },
      {
        "name": "AI-Powered Code Review & Optimization Platform",
        "details": [
          "Developed an AI-driven code review system, integrating Gemini AI for performance & security analysis.",
          "Built secure APIs that analyze GitHub PRs & suggest AI-powered optimizations, reducing manual review time by 60%.",
          "Automated security scans for vulnerabilities & best practices, improving code quality & compliance.",
          "Deployed via Docker & Kubernetes, ensuring scalability for large-scale repositories.",
          "Implemented CI/CD pipelines with GitHub Actions, achieving continuous testing & zero-downtime deployments."
        ]
      }
    ]
  },
  {
    "id": 6,
    "info": "Certifications",
    "description": [
      "AWS Developer Associate (AWS)",
      "AWS Data Engineer Associate (AWS)",
      "Google Professional Data Analytics (Coursera)",
      "KCNA (Kubernetes & Cloud Native Associate - The Linux Foundation)",
      "Docker Foundations (LinkedIn)"
    ]
  },
  {
    "id": 7,
    "info": "Skills",
    "description": [
      "Programming: Python, Java, JavaScript, TypeScript, SQL",
      "Web Development: Node.js, Express.js, Spring Boot, React.js, Next.js, Tailwind CSS",
      "Cloud & DevOps: AWS (Lambda, EC2, S3), GCP, Docker, Kubernetes, Terraform, Jenkins",
      "AI & Data Engineering: OpenAI API, Gemini AI, PostgreSQL, MongoDB, Power BI, Tableau",
      "Security & Optimization: OAuth, JWT, Redis Caching, API Rate Limiting, CI/CD Pipelines"
    ]
  }
]